In [4]:
import pandas as pd

In [5]:
data = pd.read_csv('data/revenue-data.csv')

In [7]:
data.head()

,Age,SiteSpending,SiteTime,RecommendImpression,Education,WorkType,Sex,Region,Salary
0,32,314.06,30.14,0,Degree,Private sector,Male,London,60173.49
1,20,3758.36,149.36,4,GCSE,Private sector,Female,South East,42965.45
2,36,601.72,21.87,0,Masters,Private sector,Male,East of England,54924.41
3,21,44.89,182.80,9,Masters,Private sector,Female,Northern Ireland,26734.99
4,24,614.80,194.34,0,GCSE,Private sector,Male,Scotland,15325.23

In [9]:
import numpy as np

In [10]:
data['£35K+ Salary'] = np.where(data['Salary'] > 35000, True, False )

In [12]:
data.head()

,Age,SiteSpending,SiteTime,RecommendImpression,Education,WorkType,Sex,Region,Salary,£35K+ Salary
0,32,314.06,30.14,0,Degree,Private sector,Male,London,60173.49,True
1,20,3758.36,149.36,4,GCSE,Private sector,Female,South East,42965.45,True
2,36,601.72,21.87,0,Masters,Private sector,Male,East of England,54924.41,True
3,21,44.89,182.80,9,Masters,Private sector,Female,Northern Ireland,26734.99,False
4,24,614.80,194.34,0,GCSE,Private sector,Male,Scotland,15325.23,False